#include<stdio.h>

double a;

int main(void){
	scanf("%lf",&a);
	if(a<100000 || a==100000){
		printf("%d",(int)a/10);
	}
	else if(100000<a && a<=200000){
		printf("%d",(int)(10000+(a-100000.0)*0.08));
	}
	else if(200000<a && a<=400000){
		printf("%d",(int)(10000+8000+(a-200000.0)*0.05));
	}
	else if(400000<a && a<=600000){ 
		printf("%d",(int)(10000+8000+10000+(a-400000.0)*0.03));
	}
	else if(600000<a && a<=1000000){
		printf("%d",(int)(10000+8000+10000+6000+(a-600000.0)*0.02));
	}
	else {
		printf("%d",(int)(10000+8000+10000+6000+8000+(a-1000000.0)*0.01));
	}
	return 0;
}

//我承认C++选手写C真的用不了许多特性 

